
NOT_SUBBED = '''
<i><b>✅ Чтобы пользоваться ботом, вы должны подписаться на все наши каналы</b>

Подпишись на все каналы ниже и нажми «Проверить подписку».</i>

%s
'''

NOT_SUBBED_FAILED = '''
<b>❌ Проверка подписки не пройдена</b>

Вы не подписались на следующие каналы:
%s

<i>Подпишитесь на недостающие каналы и нажмите «Проверить подписку».</i>
'''

DEFAULT_VIP = 'Данный функционал доступен только для VIP пользователей'

VIP = '''
<b>Преимущества VIP 👑:</>

<i>❌ - Отключение рекламы
🖼 - Обмен медиа (фото, видео, гифки, стикеры)</>
'''
BUY_VIP_BALANCE = '''<b>Подписка VIP 👑
🗓 Дней - </b> %s

Стоимость: %s ₽
Ваш баланс: %s ₽
'''


TOP_UP_BALANCE = '''
💰 Пополнение баланса на сумму: %s ₽

• <i>После оплаты нажмите на кнопку "Проверить"</i> ✅
'''

PLATEGA_TOP_UP_BALANCE = '''
<a href="https://telegra.ph/your-privacy-policy">Политика конфиденциальности</a>

<a href="https://telegra.ph/your-terms-of-use">Пользовательское соглашение</a>

💰 Пополнение баланса на сумму: %s ₽

• <i>После оплаты нажмите на кнопку "Проверить"</i> ✅
'''

BILL = '''
⭐️ Чтобы получить доступ к VIP - подписке, оплатите счёт ниже ⬇️

• <i>После оплаты нажмите на кнопку "Проверить"</i> ✅
'''

PLATEGA_BILL = '''
<a href="https://telegra.ph/your-privacy-policy">Политика конфиденциальности</a>

<a href="https://telegra.ph/your-terms-of-use">Пользовательское соглашение</a>

⭐️ Чтобы получить доступ к VIP - подписке, оплатите счёт ниже ⬇️

• <i>После оплаты нажмите на кнопку "Проверить"</i> ✅
'''
REF = '''
<i>Приглашайте пользователей по своей ссылке и получайте</> <b>👑 VIP статус</> <i>на 1 день за каждого пятого друга!</>

<b>Приглашено:</> <code>%i</>

Ваша персональная ссылка:
👉  https://t.me/%s?start=%i
'''

BANNED = '<b>⛔️ Ваш аккаунт заблокирован.</>'
